spec/fixtures/vcr/Jackpot_Payment/_create/with_valid_token_information/creates_a_new_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&customer_vault=add_customer&customer_vault_id=&ccnumber=5555555555554444&cvv=123&ccexp=0113&firstname=foo&lastname=bar
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Mon, 05 Mar 2012 14:46:13 GMT
      server:
      - Apache
      content-length:
      - '202'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=583797021
    http_version: '1.1'
  recorded_at: Mon, 05 Mar 2012 14:46:13 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&type=auth&orderid=&customer_vault_id=583797021&currency=USD&tax=&amount=42.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Mon, 05 Mar 2012 14:46:15 GMT
      server:
      - Apache
      content-length:
      - '215'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1576443507&avsresponse=&cvvresponse=&orderid=&type=auth&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=583797021
    http_version: '1.1'
  recorded_at: Mon, 05 Mar 2012 14:46:17 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&type=capture&transactionid=1576443507&amount=42.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Mon, 05 Mar 2012 14:46:19 GMT
      server:
      - Apache
      content-length:
      - '209'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1576443507&avsresponse=&cvvresponse=&orderid=&type=capture&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=
    http_version: '1.1'
  recorded_at: Mon, 05 Mar 2012 14:46:21 GMT
recorded_with: VCR 2.0.0
