spec/fixtures/vcr/Jackpot_Payment/_create/with_valid_token_information/does_not_persist_credit_card_token_information.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body: username=demo&password=password&customer_vault=add_customer&customer_vault_id=&ccnumber=5555555555554444&cvv=123&ccexp=0113&firstname=foo&lastname=bar
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Fri, 10 Feb 2012 01:36:35 GMT
      server:
      - Apache
      content-length:
      - '203'
      connection:
      - close
      content-type:
      - text/html
    body: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=1744647340
    http_version: '1.1'
  recorded_at: Fri, 10 Feb 2012 01:36:36 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body: username=demo&password=password&type=auth&orderid=&customer_vault_id=1744647340&currency=USD&tax=&amount=42.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Fri, 10 Feb 2012 01:36:38 GMT
      server:
      - Apache
      content-length:
      - '216'
      connection:
      - close
      content-type:
      - text/html
    body: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1561161651&avsresponse=&cvvresponse=&orderid=&type=auth&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=1744647340
    http_version: '1.1'
  recorded_at: Fri, 10 Feb 2012 01:36:40 GMT
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body: username=demo&password=password&type=capture&transactionid=1561161651&amount=42.00
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Fri, 10 Feb 2012 01:36:42 GMT
      server:
      - Apache
      content-length:
      - '209'
      connection:
      - close
      content-type:
      - text/html
    body: response=1&responsetext=SUCCESS&authcode=123456&transactionid=1561161651&avsresponse=&cvvresponse=&orderid=&type=capture&response_code=100&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=
    http_version: '1.1'
  recorded_at: Fri, 10 Feb 2012 01:36:43 GMT
recorded_with: VCR 2.0.0.rc1
